AESSoft.aessoft-class-autocomplete
andys8.jest-snippets
apollographql.vscode-apollo
brunnerh.insert-unicode
bungcip.better-toml
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
danielpinto8zz6.c-cpp-compile-run
DavidAnson.vscode-markdownlint
dbankier.vscode-instant-markdown
deerawan.vscode-faker
donjayamanne.jupyter
donjayamanne.python-extension-pack
eg2.tslint
eg2.vscode-npm-script
Equinusocio.vsc-material-theme
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.code-runner
glen-84.sass-lint
jbenden.c-cpp-flylint
jeremyrajan.vscode-lebab
jithurjacob.nbpreviewer
kaiwood.endwise
kalitaalexey.vscode-rust
magicstack.MagicPython
misogi.ruby-rubocop
ms-python.python
ms-vscode.cpptools
ms-vscode.vscode-typescript-tslint-plugin
ms-vsliveshare.vsliveshare
msjsdiag.debugger-for-chrome
octref.vetur
OfHumanBondage.react-proptypes-intellisense
Orta.vscode-jest
Perkovec.emoji
PeterJausovec.vscode-docker
PKief.material-icon-theme
rebornix.ruby
rust-lang.rust
third774.hipsum
Tobermory.es6-string-html
tokoph.ghosttext
VisualStudioExptTeam.vscodeintellicode
waderyan.gitblame
wholroyd.jinja
